In [74]:
import pandas as pd

In [75]:
## series
## A  Pandas Series is a one-dimensional array-like object that can hold various data types, including integers, floats, strings, and more. It is similar to a column in a spreadsheet or a database table.

import pandas as pd
data= [1,2,3,4,5]
series = pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [76]:
## Create a Series from Dictionary
data = {'a': 1, 'b': 2, 'c': 3}
print(pd.Series(data))

a    1
b    2
c    3
dtype: int64

In [77]:
data = [10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [78]:
## DataFrame
## Create a DataFrame from a dictionary of lists

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Bangalore', 'Chicago']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age       City
0    Alice   25   New York
1      Bob   30  Bangalore
2  Charlie   35    Chicago
<class 'pandas.core.frame.DataFrame'>

In [85]:
## Creating DataFrame from list of dictionaries

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Bangalore', 'Chicago']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age       City
0    Alice   25   New York
1      Bob   30  Bangalore
2  Charlie   35    Chicago
<class 'pandas.core.frame.DataFrame'>

In [80]:
df=pd.read_csv('sales_data.csv')
df.head()  ## first 5 rows

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [81]:
df.tail() ## last 5 rows

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [82]:
## Accessing Data from DataFrame
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [86]:
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [ ]:
df.loc[0]  ## first row

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [ ]:
df.iloc[0][2] ## first row, third column

C:\Users\HP\AppData\Local\Temp\ipykernel_6208\3744287582.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2] ## first row, third column

'New York'

In [ ]:
## Accessing a specified element
print(df.at[1,'Age'])

30

In [ ]:
## Accessing specified element using iat
print(df.iat[1,1])

30

In [ ]:
## Data manipulation with dataframe
df

      Name  Age       City
0    Alice   25   New York
1      Bob   30  Bangalore
2  Charlie   35    Chicago

In [ ]:
## Adding a new column to DataFrame
df['salary']=[50000,60000,70000]

In [ ]:
df

      Name  Age       City  salary
0    Alice   25   New York   50000
1      Bob   30  Bangalore   60000
2  Charlie   35    Chicago   70000

In [ ]:
## its not permanent its the temporary deletion
df.drop('salary',axis=1) ## its temprory deletion

      Name  Age       City
0    Alice   25   New York
1      Bob   30  Bangalore
2  Charlie   35    Chicago

In [ ]:
df

      Name  Age       City  salary
0    Alice   25   New York   50000
1      Bob   30  Bangalore   60000
2  Charlie   35    Chicago   70000

In [ ]:
## Removing a column permanently
df.drop('salary',axis=1,inplace=True) ## permanent deletion

In [ ]:
df

      Name  Age       City
0    Alice   25   New York
1      Bob   30  Bangalore
2  Charlie   35    Chicago

In [ ]:
df['Age']=df['Age']+1

In [ ]:
df

      Name  Age       City
0    Alice   28   New York
1      Bob   33  Bangalore
2  Charlie   38    Chicago

In [ ]:
df.drop(0,axis=0,inplace=True)

In [ ]:
df

      Name  Age       City
1      Bob   33  Bangalore
2  Charlie   38    Chicago

In [ ]:
df.head()

      Name  Age       City
1      Bob   33  Bangalore
2  Charlie   38    Chicago

In [87]:
df=pd.read_csv('sales_data.csv')
df.head()  ## first 5 rows

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [88]:
# Display the data types of each column
print(df.dtypes)

## Describe the dtaframe
print("Statistical Summary:\n", df.describe())

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical Summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [89]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000